Tekla.Structures.Plugins.DirectManipulation.Services.Handles.ArcHandle
Represents a handle that is represented as an arc in the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.ArcHandle.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IArcHandle)
Creates an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PointHandle class.
nativeHandle: Underlying DM handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.ArcHandle.WrappedHandle
Gets the underlying segment handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.ArcHandle.Radius
Gets or sets the radius value of the arc.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.ArcHandle.Arc
Gets or sets the underlying arc of the handle.